Show / Hide Table of Contents
Interface IGrpcMessageHandler<T>
Handles communication over Grpc.
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public interface IGrpcMessageHandler<T> : IGrpcMessageHandler where T : class
Type Parameters
 Name |  Description
 T
Methods
Improve this Doc   View Source
HandleClientMessage(GrpcMessage, GrpcClient)
Handles response incoming from the server.
Declaration
Task<T> HandleClientMessage(GrpcMessage message, GrpcClient client)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Message sent by server.
 GrpcClient |  client
Returns
 Type |  Description
 System.Threading.Tasks.Task<T>
Improve this Doc   View Source
HandleServerMessage(GrpcMessage, GrpcServer)
Handles request incoming from the client.
Declaration
Task<T> HandleServerMessage(GrpcMessage message, GrpcServer server)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Message sent by client.
 GrpcServer |  server
Returns
 Type |  Description
 System.Threading.Tasks.Task<T>
 Improve this Doc
 View Source